bench/reproducible/results/phase6-profile-inventory-pr79-20260602T031308Z/runs/queries-pool/raw/kruda-throughput-queries-round-2.txt
Running 10s test @ http://127.0.0.1:3260/queries
  4 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.42ms    1.22ms   7.97ms   79.84%
    Req/Sec    14.78k     9.86k   25.88k    62.50%
  Latency Distribution
     50%    1.11ms
     75%    2.06ms
     90%    2.94ms
     99%    5.86ms
  11764 requests in 10.02s, 1.75MB read
Requests/sec:   1173.91
Transfer/sec:    178.59KB